DROP TABLE IF EXISTS products;

CREATE TABLE products (
  id INT AUTO_INCREMENT PRIMARY KEY,
  title VARCHAR(40) NOT NULL,
  url VARCHAR(100) NOT NULL,
  category VARCHAR(10) NOT NULL,
  price DOUBLE DEFAULT NULL
);

INSERT INTO products (title, url, category, price) VALUES
  ('Дыня', 'дыня 200-142.png', 'ягоды', 157.89),
  ('Мандарин', 'мандарин 200-160.png', 'фрукты', 64.39),
  ('Томат', 'томат 199-170.png', 'овощи', 160),
  ('Картофель', 'картофель 145-100.png', 'овощи', 49.99),
  ('Яблоко', 'яблоко 147-150.png', 'фрукты', 136.89),
  ('Лимон', 'лимон 150-150.png', 'фрукты', 80.99),
  ('Банан', 'банан 192-176.png', 'фрукты', 84.59),
  ('Перец', 'перец 200-200.png', 'овощи', 239.89),
  ('Лук', 'лук 181-200.png', 'овощи', 59.99),
  ('Груша', 'груша 200-200.png', 'фрукты', 178.99),
  ('Капуста', 'капуста 192-175.png', 'овощи', 15.89),
  ('Ананас', 'ананас 200-200.png', 'фрукты', 168.49),
  ('Черешня', 'черешня 200-132.png', 'ягоды', 579),
  ('Морковь', 'морковь 250-150.png', 'овощи', 69.91),
  ('Виноград', 'виноград 192-186.png', 'ягоды', 263.19),
  ('Арбуз', 'арбуз 200-160.png', 'ягоды', 273.69),
  ('Огурец', 'огурец 170x170.png', 'овощи', 157.79);
  